"""
Напишите программу вывода переменной math.pi с точностью до тысячных
(три знака после запятой).

Sample Input:

Sample Output:

3.142
"""

from math import pi

print(round(pi, 3))
